load-test/stress-test.yaml
config:
  target: "http://localhost:8000"
  phases:
    - duration: 60  # Run the test for 60 seconds
      arrivalRate: 20  # Start with 5 users per second
  socketio:
    transports: ["websocket"]
  payload:
    # Generate random chat IDs for each virtual user
    - path: "chatIds.csv"
      fields:
        - "chatId"

scenarios:
  - engine: "socketio"
    flow:
      - think: 1  # Wait for 1 second before starting the loop
      - loop:
          - emit:
              channel: "message"
              data:
                message: "Hello, chatbot!"
                chatId: "{{ chatId }}"
          - think: 3  # Wait for 3 seconds after receiving the response before sending the next message
        count: 5  # Repeat this loop 5 times